{
  "backend/main.mo": "Main Motoko actor defining blood donation platform types (BloodGroup, UserProfile, BloodRequest, ActiveLocation) and implementing profile management, blood request CRUD operations, donor matching, and location tracking with role-based access control.",
  "feature_evidence.json": "Feature evidence report documenting implementation of location tracking functionality across LocationTrackingPage component, routing, navigation, and map marker display for donors and blood requests.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of all frontend source files including pages, components, hooks, and utilities for the blood donation platform.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes for UI components including primary, secondary, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point loading Google Maps JavaScript API with Places library and mounting React application at root div.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for landing, auth, blood request/donation, dashboard, profile, chat, request details, and location tracking pages wrapped in ThemeProvider and Toaster.",
  "frontend/src/components/BloodRequestCard.tsx": "Card component displaying blood request details with formatted blood group, urgency/status badges, location, timestamp, and view details button with color-coded urgency and status indicators.",
  "frontend/src/components/CreateBloodRequestForm.tsx": "Form component for creating blood requests with blood group selection, urgency level dropdown, Google Maps place picker for location, and submission handling with validation and success callbacks.",
  "frontend/src/components/FeatureCard.tsx": "A reusable card component that displays an icon, title, and description with hover effects for showcasing features.",
  "frontend/src/components/GoogleMapsPlacePicker.tsx": "An autocomplete location picker component that integrates with Google Maps Places API to extract address, city, latitude, and longitude from user input.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component with navigation, footer, and conditional profile setup modal that renders when authenticated users lack a profile.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout and clears query cache on logout.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation header with logo, authenticated/unauthenticated menu links, and mobile sheet menu with login button.",
  "frontend/src/components/ProfileForm.tsx": "Form component for editing user profile including name, blood group, location (via Google Maps picker), contact preferences, and availability toggle.",
  "frontend/src/components/ProfileSetupModal.tsx": "Non-dismissible modal dialog for first-time profile setup requiring name, blood group, role, location, and contact preferences.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication and admin token initialization.",
  "frontend/src/hooks/useCreateBloodRequest.ts": "Mutation hook for creating blood requests with blood group, location, and urgency parameters, invalidating related queries on success.",
  "frontend/src/hooks/useGetActiveLocations.ts": "Query hook that fetches active location data with 30-second auto-refresh interval for real-time tracking updates.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the current authenticated user's profile, returning null if no profile exists.",
  "frontend/src/hooks/useGetMatchingRequests.ts": "React Query hook that filters and returns blood requests matching the current user's blood donation compatibility, excluding their own requests and only showing pending requests.",
  "frontend/src/hooks/useGetRequestDetails.ts": "React Query hook that retrieves details for a specific blood request by ID from the user's requests list.",
  "frontend/src/hooks/useGetUserRequests.ts": "React Query hook that fetches all blood requests associated with the currently authenticated user's principal.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient configuration with delegation support.",
  "frontend/src/hooks/useQueries.ts": "React Query hook for fetching all blood requests (currently returns empty array as placeholder).",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React Query mutation hook that saves the current user's profile to the backend and invalidates the profile cache on success.",
  "frontend/src/hooks/useUpdateAvailability.ts": "React Query mutation hook that updates the user's blood donation availability status by saving their profile with the new availability flag.",
  "frontend/src/hooks/useUpdateRequestStatus.ts": "React Query mutation hook that updates a blood request's status and invalidates related queries on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Empty file placeholder for admin dashboard page.",
  "frontend/src/pages/AuthPage.tsx": "Authentication page that displays login UI and redirects authenticated users with profiles to the dashboard.",
  "frontend/src/pages/BloodDonationPage.tsx": "Page for donors to manage their availability status and view matching blood requests they can fulfill based on blood type compatibility.",
  "frontend/src/pages/BloodRequestPage.tsx": "Page for users to create new blood requests and view/manage their existing requests with a collapsible form interface.",
  "frontend/src/pages/ChatPage.tsx": "Placeholder chat page with UI shell for future messaging functionality between donors and receivers.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying user profile information, availability toggle, and blood requests with edit functionality. Redirects unauthenticated users to auth page.",
  "frontend/src/pages/DonorDashboard.tsx": "Empty file, likely a placeholder for donor-specific dashboard functionality.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, feature cards, and how-it-works explanation. Redirects authenticated users with profiles to dashboard.",
  "frontend/src/pages/LocationTrackingPage.tsx": "Google Maps integration page displaying active donor and blood request locations with markers, info windows, and real-time tracking. Requires authentication.",
  "frontend/src/pages/ProfilePage.tsx": "Dedicated profile management page allowing users to view and edit their personal information including blood group, location, and contact preferences.",
  "frontend/src/pages/ReceiverDashboard.tsx": "Empty file, likely a placeholder for receiver-specific dashboard functionality.",
  "frontend/src/pages/RequestDetailsPage.tsx": "Detailed view of a blood request showing urgency, status, location, and matched donor information with status update functionality for authorized users.",
  "frontend/src/types/google-maps.d.ts": "TypeScript type definitions for Google Maps JavaScript API including Autocomplete, LatLng, LatLngBounds, and Places interfaces.",
  "frontend/src/utils/bloodGroupUtils.ts": "Utility functions for formatting blood group display strings and checking blood type compatibility between donors and receivers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document for BloodLine, a real-time blood donation platform with React frontend, RESTful backend, role-based access control (Donor/Receiver/Admin), Google Maps integration, and features for user authentication, profile management, blood requests, and location-based matching."
}